using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using System.Linq;

namespace Utility {


    //-----------------------------------------------------------------------------
    //! [制作者]     長沼豪琉
    //!	[最終更新日] 2021/10/14
    //! [内容]       Dictionaryをインスペクターに表示できるようにする
    //-----------------------------------------------------------------------------
    [System.Serializable]
    public class DictionaryBase<Tkey, TValue, Type> where Type : KeyAndValue<Tkey, TValue>
    {
        //-----------------------------------------------------------------------------
        //! private変数
        //-----------------------------------------------------------------------------
        [SerializeField]
        private List<Type>               list ;
        private Dictionary<Tkey, TValue> table;

        //-----------------------------------------------------------------------------
        //! public変数
        //-----------------------------------------------------------------------------

        //-----------------------------------------------------------------------------
        //! [内容]    ディクショナリーを取得する
        //! [戻り値]  Dictionary
        //-----------------------------------------------------------------------------
        public Dictionary<Tkey,TValue> GetDictionary()
        {
            if (table == null) {
                table = ConvertListToDictionary(list);
            }
            return table;
        }

        //-----------------------------------------------------------------------------
        //! [内容]    リストを取得する
        //! [戻り値]  List
        //-----------------------------------------------------------------------------
        public List<Type> GetList()
        {
            return list;
        }

        //-----------------------------------------------------------------------------
        //! [内容]    リストをDictionaryに変換
        //-----------------------------------------------------------------------------
        static Dictionary<Tkey,TValue> ConvertListToDictionary(List<Type> list)
        {
            Dictionary<Tkey, TValue> dic = new Dictionary<Tkey, TValue>();
            foreach (var pair in list) {
                dic.Add(pair.key, pair.value);
            }
            return dic;
        }

    }

    //-----------------------------------------------------------------------------
    //! [制作者]     長沼豪琉
    //!	[最終更新日] 2021/10/14
    //! [内容]       シリアル化出来るペア
    //-----------------------------------------------------------------------------
    [System.Serializable]
    public class KeyAndValue<Tkey,TValue>
    {
        //-----------------------------------------------------------------------------
        //! private変数
        //-----------------------------------------------------------------------------

        //-----------------------------------------------------------------------------
        //! public変数
        //-----------------------------------------------------------------------------
        public Tkey   key  ;
        public TValue value;

        //-----------------------------------------------------------------------------
        //! [内容]    コンストラクタ
        //-----------------------------------------------------------------------------
        public KeyAndValue(Tkey tKey, TValue tValue)
        {
            key   = tKey  ;
            value = tValue;
        }

        //-----------------------------------------------------------------------------
        //! [内容]    コンストラクタ
        //-----------------------------------------------------------------------------
        public KeyAndValue(KeyValuePair<Tkey,TValue> pair)
        {
            key   = pair.Key  ;
            value = pair.Value;
        }
    }
}