using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using MonobitEngine;

//-----------------------------------------------------------------------------
//! [制作者]     長沼豪琉
//! [最終更新日] 2021/10/13
//! [内容]       指定したオブジェクトがレジに入ったか判定
//-----------------------------------------------------------------------------
public class CashRegisterArea : MonobitEngine.MonoBehaviour
{
    //-----------------------------------------------------------------------------
    //! private変数
    //-----------------------------------------------------------------------------
    private GameObject cartObject     ; // カートのオブジェクト
    private bool       isFound = false; // カートが見つかったか
    private bool       _inArea = false; // エリア内か

    //-----------------------------------------------------------------------------
    //! public変数
    //-----------------------------------------------------------------------------
    public bool  inArea {      // エリア内か
        get { return _inArea; }
    }

    //-----------------------------------------------------------------------------
    //! Inspectorに公開する変数
    //-----------------------------------------------------------------------------
    [Header("プレハブ")] public GameObject prefab; // カートのプレハブ

    //-----------------------------------------------------------------------------
    //! [内容]    開始処理
    //-----------------------------------------------------------------------------
    void Start()
    {
        if (!prefab) {
            Debug.LogError(this.name + "でプレハブが設定されていません。");
        }
    }

    //-----------------------------------------------------------------------------
    //! [内容]    更新処理
    //-----------------------------------------------------------------------------
    void Update()
    {
        // 自分がホストじゃない場合は処理を行わない
        if (MonobitNetwork.isHost) {
            if (!isFound && prefab) {
                if (MonobitNetwork.inRoom) {
                    // カートのゲームオブジェクトを検索
                    cartObject = GameObject.Find(prefab.name + "(Clone)");
                    // オブジェクトが見つかったらフラグを立てる
                    isFound = cartObject ? true : false;
                }
            }
        }
    }

    //-----------------------------------------------------------------------------
    //! [内容]    更新処理
    //-----------------------------------------------------------------------------
    void LateUpdate()
    {
        //_inArea = false;
    }

    //-----------------------------------------------------------------------------
    //! [内容]    当たり判定
    //-----------------------------------------------------------------------------
    private void OnTriggerStay(Collider collider)
    {
        if (cartObject) {
            // 設定されているオブジェクトと当たっている場合のみ
            if (cartObject == collider.gameObject.transform.root.gameObject) {
                _inArea = true;
            }
        }
    }

    //-----------------------------------------------------------------------------
    //! [内容]    当たり判定
    //-----------------------------------------------------------------------------
    private void OnTriggerExit(Collider other) {
        _inArea = false;
    }
}
