using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.Events;

//-----------------------------------------------------------------------------
//! [制作者]     長沼豪琉
//! [最終更新日] 2021/10/25
//! [内容]       プレイヤー生成時のコールバック
//-----------------------------------------------------------------------------
public class InstancePlayerCallback : MonoBehaviour
{
    //-----------------------------------------------------------------------------
    //! Inspectorに公開する変数
    //-----------------------------------------------------------------------------
    [Header("生成時呼び出す関数")] public UnityEvent CallOnGeneration; // 生成時イベント
    [Header("削除時呼び出す関数")] public UnityEvent CallOnDestroy   ; // 削除時イベント

    //-----------------------------------------------------------------------------
    //! [内容]    開始処理
    //-----------------------------------------------------------------------------
    void Start()
    {
        // イベント発行
        CallOnGeneration?.Invoke();
    }

    //-----------------------------------------------------------------------------
    //! [内容]     削除処理（コールバック）
    //-----------------------------------------------------------------------------
    void OnDestroy()
    {
        // インベント発行
        CallOnDestroy?.Invoke();
    }
}
