using System.Collections;
using System.Collections.Generic;
using UnityEngine;


//-----------------------------------------------------------------------------
//! [制作者]		小野龍大
//!	[最終更新日]	2021/10/06
//! [内容]		このオブジェクトに触れているものを
//-----------------------------------------------------------------------------
public class  ReturnHitObj: MonoBehaviour
{
    //-----------------------------------------------------------------------------
    //!	public変数
    //-----------------------------------------------------------------------------
    public List<GameObject> exceptionList = new List<GameObject>();        // 触れいても含めないオブジェクト

    void Start()
    {
        
    }

    void Update()
    {
        
    }
}
